blog/2016-05-12-mac学习整理.org
#+TITLE: Mac学习整理
#+DATE: 2016-05-12
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Mac
#+JEKYLL_TAGS: Mac 快捷键
#+JEKYLL_PUBLISHED: true

记录了Mac使用中常用的功能以及快捷键




-----
* Mac开机
- 可以利用插耳机来避免开机提示音
- 系统引导的时候长按 ⌥ 来选择启动磁盘
- 在开机的时候按住 ⇧ 会以安全模式启动OS X

* 桌面
** 窗口
- 新建窗口：⌘+N
- 最小化窗口：⌘+M （最小化窗口后，焦点依然在该窗口上）
- 最小化当前程序所有打开的窗口：⌘+⌥+M
- 隐藏窗口：⌘+H（隐藏窗口后不会在Dock栏右侧显示，焦点会进行切换）
- 隐藏所有其他窗口：⌘+⌥+H


- 全屏显示窗口：⌘+⌃+F
- 如何显示最大化？按住 ⌥ ，之后点击窗口上的绿色按钮



- 关闭当前窗口：⌘+W
- 关闭应用程序打开的所有窗口：⌘+⌥+W
- 退出应用程序：⌘+Q


- 按住 ⌘ 可以对后台的程序进行操作而不改变焦点


- 打开偏好设置: ⌘+,

** Mission Control
- 开启方式：F3或者三指向上滑（三指下滑可以启动Expose）
- 鼠标指向程序的时候按空格键可以放大程序窗口
- 开启Mission Control的时候也可以使用三指左右滑切换窗口
- Mission Control中的桌面可以缩小全屏的应用

** Dock栏

- 打开图标所在文件夹：按住 ⌘ 打开
- 隐藏其他程序之后打开程序：按住 ⌥ 打开
- 清空废纸篓：⌘+⇧+<delete>
- 恢复废纸篓的文件：⌘+<delete>

** Mini Dock栏
- 相当于Windows中的程序切换器
- 打开方式：按住 ⌘ 后，使用<tab>、<~>键进行左右移动
- 在Mini Dock栏下，按 H 将隐藏程序，按 Q 将退出程序，按 1 可以预览程序

** 触摸板
- 详细可以参考触摸板设置的说明

* 文件夹
** Finder
- 在桌面按 ⌘+N 或者通过Dock栏的Finder打开
- 可以将文件或文件夹通过按住 ⌘ 来添加进工具栏
- Finder的标题栏图标代表当前文件夹，可以进行拖动，右击会显示上级文件夹
- ⌘+1/2/3/4 可以切换Finder的显示模式，⌘+J则可以自定义当前文件夹的视图选项
- ⌘+⇧+P 可以显示文件的预览
- ⌘+T 可以新建标签，⌘+W 则可以删除标签

** 常用文件操作
| 目的                 | 快捷键                 |
|----------------------+------------------------|
| 间隔选择多个文件     | 按住 ⌘ 后选择文件      |
| 全选                 | ⌘+A                    |
| 打开文件             | ⌘+O                    |
| 在新标签中打开文件夹 | 按住 ⌘ 后打开          |
| 剪切文件             | 粘贴的时候使用⌘+⌥+V    |
| 拷贝文件、复制文件名 | ⌘+C，按住 ⌥ 后拖动文件 |
| 粘贴文件、粘贴文件名 | ⌘+V                    |
| 新建文件夹           | ⌘+⇧+N                  |
| 删除文件             | ⌘+<del>                |
| 重命名               | <return>               |
| 前往文件夹           | ⌘+⇧+G                  |

** 特殊操作
- 复制 :: 
  - 复制与拷贝不同，复制会直接复制一个副本到当前文件夹中
  - 快捷键：⌘+D
- 创建替身 ::
  - 替身相当与快捷方式，但是替身会自动与原文件保持关联（即原文件移动，替身地址会跟着改变）
  - 快捷键：⌘+L，按住 ⌘+⌥ 然后拖动
  - 对替身文件按 ⌘+R 可以找到原文件
- 标记 ::
  - 使用“标记”可以用颜色来标记同一种类的文件或文件夹，之后可以通过颜色来找到这些文件夹或文件
  - 使用工具栏中的“标记”工具来进行标记
- 显示简介 ::
  - 显示简介相当于Windows的属性，可以修改标记、打开方式、锁定文件（即文件只能复制和查看）
  - 简介内点击图标后粘贴自己的图片可以改变文件的图标
  - 快捷键：⌘+I，若要同时查看多个文件则按 ⌘+⌥+I
- 压缩文件 ::
  - 将文件压缩成zip
  - 快捷键：⌘+O
- 快速查看 ::
  - 快速打开一个窗口来预览文件的内容
  - 快捷键：空格键
  - 若想要能在快速查看的时候复制本文，则需要在终端中输入 =defaults write com.apple.finder QLEnableTextSelection -bool TRUE;killall Finder=
- 图片截图 ::
  - 使用“预览”应用打开图片，直接拖动鼠标选择范围后使用 ⌘+C
- 多文件重命名 ::
  - 选中多个文件后右键菜单选择命名，后边可以自己定义命名模式

* Mac技巧
- 通过滚动手拾显示文件堆栈或应用程序Expose ::
  - 该功能可以用在Dock上使用滚动手势查看应用程序打开的所有窗口
  - 启用该功能的命令： =defaults write com.apple.dock scroll-to-open -bool TRUE;killall Dock=
- 使用滚动条跳入新的位置 ::
  - 指针移动到滚动条想跳转的地方，按住 ⌥ 并点击
- 在Dock栏上添加最近使用的项目文件栈 ::
  - 在终端下输入： =defaults write com.apple.dock persistent-others -array-add '{ "tile-data" = { "list-type" = 1; }; "tile-type" = "recents-tile";}';killall Dock=
- Dock栏上显示隐藏窗口的应用程序 ::
  - 隐藏窗口的程序会显示为透明状态
  - 在终端下输入： =defaults write com.apple.dock showhidden -bool TRUE;killall Dock= 
- 通过快捷键快速打开Finder窗口 ::
  - 在弹出文件打开或保存对话框后按 ⌘+R 键, 会打开当前正在浏览的Finder窗口。
  - 当把某个文件夹拖到打开、保存对话框的时候，可以直接跳到该文件夹的位置
- 通过终端搜索文件 ::
  - 可以使用 **mdfind** 命令来进行搜索
