_posts/2016-05-12-mac学习整理.html
---
title: "Mac学习整理"
date: 2016-05-12
layout: post
categories: 
- Mac
tags: 
- Mac 
- 快捷键
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Mac开机</a></li>
<li><a href="#orgheadline7">2. 桌面</a>
<ul>
<li><a href="#orgheadline2">窗口</a></li>
<li><a href="#orgheadline3">Mission Control</a></li>
<li><a href="#orgheadline4">Dock栏</a></li>
<li><a href="#orgheadline5">Mini Dock栏</a></li>
<li><a href="#orgheadline6">触摸板</a></li>
</ul>
</li>
<li><a href="#orgheadline11">3. 文件夹</a>
<ul>
<li><a href="#orgheadline8">Finder</a></li>
<li><a href="#orgheadline9">常用文件操作</a></li>
<li><a href="#orgheadline10">特殊操作</a></li>
</ul>
</li>
<li><a href="#orgheadline12">4. Mac技巧</a></li>
</ul>
</div>
</div>
<p>
记录了Mac使用中常用的功能以及快捷键
</p>




<hr  />
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Mac开机</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>可以利用插耳机来避免开机提示音</li>
<li>系统引导的时候长按 ⌥ 来选择启动磁盘</li>
<li>在开机的时候按住 ⇧ 会以安全模式启动OS X</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">2</span> 桌面</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">窗口</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ul class="org-ul">
<li>新建窗口：⌘+N</li>
<li>最小化窗口：⌘+M （最小化窗口后，焦点依然在该窗口上）</li>
<li>最小化当前程序所有打开的窗口：⌘+⌥+M</li>
<li>隐藏窗口：⌘+H（隐藏窗口后不会在Dock栏右侧显示，焦点会进行切换）</li>
<li>隐藏所有其他窗口：⌘+⌥+H</li>
</ul>


<ul class="org-ul">
<li>全屏显示窗口：⌘+⌃+F</li>
<li>如何显示最大化？按住 ⌥ ，之后点击窗口上的绿色按钮</li>
</ul>



<ul class="org-ul">
<li>关闭当前窗口：⌘+W</li>
<li>关闭应用程序打开的所有窗口：⌘+⌥+W</li>
<li>退出应用程序：⌘+Q</li>
</ul>


<ul class="org-ul">
<li>按住 ⌘ 可以对后台的程序进行操作而不改变焦点</li>
</ul>


<ul class="org-ul">
<li>打开偏好设置: ⌘+,</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Mission Control</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ul class="org-ul">
<li>开启方式：F3或者三指向上滑（三指下滑可以启动Expose）</li>
<li>鼠标指向程序的时候按空格键可以放大程序窗口</li>
<li>开启Mission Control的时候也可以使用三指左右滑切换窗口</li>
<li>Mission Control中的桌面可以缩小全屏的应用</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Dock栏</h3>
<div class="outline-text-3" id="text-orgheadline4">
<ul class="org-ul">
<li>打开图标所在文件夹：按住 ⌘ 打开</li>
<li>隐藏其他程序之后打开程序：按住 ⌥ 打开</li>
<li>清空废纸篓：⌘+⇧+&lt;delete&gt;</li>
<li>恢复废纸篓的文件：⌘+&lt;delete&gt;</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Mini Dock栏</h3>
<div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li>相当于Windows中的程序切换器</li>
<li>打开方式：按住 ⌘ 后，使用&lt;tab&gt;、&lt;~&gt;键进行左右移动</li>
<li>在Mini Dock栏下，按 H 将隐藏程序，按 Q 将退出程序，按 1 可以预览程序</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">触摸板</h3>
<div class="outline-text-3" id="text-orgheadline6">
<ul class="org-ul">
<li>详细可以参考触摸板设置的说明</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">3</span> 文件夹</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">Finder</h3>
<div class="outline-text-3" id="text-orgheadline8">
<ul class="org-ul">
<li>在桌面按 ⌘+N 或者通过Dock栏的Finder打开</li>
<li>可以将文件或文件夹通过按住 ⌘ 来添加进工具栏</li>
<li>Finder的标题栏图标代表当前文件夹，可以进行拖动，右击会显示上级文件夹</li>
<li>⌘+1/2/3/4 可以切换Finder的显示模式，⌘+J则可以自定义当前文件夹的视图选项</li>
<li>⌘+⇧+P 可以显示文件的预览</li>
<li>⌘+T 可以新建标签，⌘+W 则可以删除标签</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">常用文件操作</h3>
<div class="outline-text-3" id="text-orgheadline9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">目的</th>
<th scope="col" class="org-left">快捷键</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">间隔选择多个文件</td>
<td class="org-left">按住 ⌘ 后选择文件</td>
</tr>

<tr>
<td class="org-left">全选</td>
<td class="org-left">⌘+A</td>
</tr>

<tr>
<td class="org-left">打开文件</td>
<td class="org-left">⌘+O</td>
</tr>

<tr>
<td class="org-left">在新标签中打开文件夹</td>
<td class="org-left">按住 ⌘ 后打开</td>
</tr>

<tr>
<td class="org-left">剪切文件</td>
<td class="org-left">粘贴的时候使用⌘+⌥+V</td>
</tr>

<tr>
<td class="org-left">拷贝文件、复制文件名</td>
<td class="org-left">⌘+C，按住 ⌥ 后拖动文件</td>
</tr>

<tr>
<td class="org-left">粘贴文件、粘贴文件名</td>
<td class="org-left">⌘+V</td>
</tr>

<tr>
<td class="org-left">新建文件夹</td>
<td class="org-left">⌘+⇧+N</td>
</tr>

<tr>
<td class="org-left">删除文件</td>
<td class="org-left">⌘+&lt;del&gt;</td>
</tr>

<tr>
<td class="org-left">重命名</td>
<td class="org-left">&lt;return&gt;</td>
</tr>

<tr>
<td class="org-left">前往文件夹</td>
<td class="org-left">⌘+⇧+G</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">特殊操作</h3>
<div class="outline-text-3" id="text-orgheadline10">
<dl class="org-dl">
<dt>复制</dt><dd><ul class="org-ul">
<li>复制与拷贝不同，复制会直接复制一个副本到当前文件夹中</li>
<li>快捷键：⌘+D</li>
</ul></dd>
<dt>创建替身</dt><dd><ul class="org-ul">
<li>替身相当与快捷方式，但是替身会自动与原文件保持关联（即原文件移动，替身地址会跟着改变）</li>
<li>快捷键：⌘+L，按住 ⌘+⌥ 然后拖动</li>
<li>对替身文件按 ⌘+R 可以找到原文件</li>
</ul></dd>
<dt>标记</dt><dd><ul class="org-ul">
<li>使用“标记”可以用颜色来标记同一种类的文件或文件夹，之后可以通过颜色来找到这些文件夹或文件</li>
<li>使用工具栏中的“标记”工具来进行标记</li>
</ul></dd>
<dt>显示简介</dt><dd><ul class="org-ul">
<li>显示简介相当于Windows的属性，可以修改标记、打开方式、锁定文件（即文件只能复制和查看）</li>
<li>简介内点击图标后粘贴自己的图片可以改变文件的图标</li>
<li>快捷键：⌘+I，若要同时查看多个文件则按 ⌘+⌥+I</li>
</ul></dd>
<dt>压缩文件</dt><dd><ul class="org-ul">
<li>将文件压缩成zip</li>
<li>快捷键：⌘+O</li>
</ul></dd>
<dt>快速查看</dt><dd><ul class="org-ul">
<li>快速打开一个窗口来预览文件的内容</li>
<li>快捷键：空格键</li>
<li>若想要能在快速查看的时候复制本文，则需要在终端中输入 <code>defaults write com.apple.finder QLEnableTextSelection -bool TRUE;killall Finder</code></li>
</ul></dd>
<dt>图片截图</dt><dd><ul class="org-ul">
<li>使用“预览”应用打开图片，直接拖动鼠标选择范围后使用 ⌘+C</li>
</ul></dd>
<dt>多文件重命名</dt><dd><ul class="org-ul">
<li>选中多个文件后右键菜单选择命名，后边可以自己定义命名模式</li>
</ul></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">4</span> Mac技巧</h2>
<div class="outline-text-2" id="text-4">
<dl class="org-dl">
<dt>通过滚动手拾显示文件堆栈或应用程序Expose</dt><dd><ul class="org-ul">
<li>该功能可以用在Dock上使用滚动手势查看应用程序打开的所有窗口</li>
<li>启用该功能的命令： <code>defaults write com.apple.dock scroll-to-open -bool TRUE;killall Dock</code></li>
</ul></dd>
<dt>使用滚动条跳入新的位置</dt><dd><ul class="org-ul">
<li>指针移动到滚动条想跳转的地方，按住 ⌥ 并点击</li>
</ul></dd>
<dt>在Dock栏上添加最近使用的项目文件栈</dt><dd><ul class="org-ul">
<li>在终端下输入： <code>defaults write com.apple.dock persistent-others -array-add '{ "tile-data" = { "list-type" = 1; }; "tile-type" = "recents-tile";}';killall Dock</code></li>
</ul></dd>
<dt>Dock栏上显示隐藏窗口的应用程序</dt><dd><ul class="org-ul">
<li>隐藏窗口的程序会显示为透明状态</li>
<li>在终端下输入： <code>defaults write com.apple.dock showhidden -bool TRUE;killall Dock</code></li>
</ul></dd>
<dt>通过快捷键快速打开Finder窗口</dt><dd><ul class="org-ul">
<li>在弹出文件打开或保存对话框后按 ⌘+R 键, 会打开当前正在浏览的Finder窗口。</li>
<li>当把某个文件夹拖到打开、保存对话框的时候，可以直接跳到该文件夹的位置</li>
</ul></dd>
<dt>通过终端搜索文件</dt><dd><ul class="org-ul">
<li>可以使用 <b><b>mdfind</b></b> 命令来进行搜索</li>
</ul></dd>
</dl>
</div>
</div>
